# vstDrawCoordArcN

## Description
```pascal
PROCEDURE vstDrawCoordArcN(
				ptLeftTopX : REAL;
				ptLeftTopY : REAL;
				ptRghtBotX : REAL;
				ptRghtBotY : REAL;
				startAngle : REAL;
				sweepAngle : REAL);
```

```python

def vs.vstDrawCoordArcN(ptLeftTopX, ptLeftTopY, ptRghtBotX, ptRghtBotY, startAngle, sweepAngle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ptLeftTopX|REAL||
|ptLeftTopY|REAL||
|ptRghtBotX|REAL||
|ptRghtBotY|REAL||
|startAngle|REAL||
|sweepAngle|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events